In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
#import seaborn as sns

In [4]:
#import random

In [5]:
df = pd.read_excel(r'D:\data\ok\fupload.xlsx')

In [6]:
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,NaN,NaN,NaN,NaN,NaN,NaN
1,F-LJ2C,C-AK9N,NaN,NaN,NaN,NaN
2,F-LJ18,1 $ 2 $ 3,NaN,NaN,NaN,NaN
3,F-LJ2A,1 $ 2 $ 4,NaN,NaN,NaN,NaN
4,F-BTJ5,10th foundation $ 10th foundation $ chemistry ...,NaN,NaN,NaN,NaN

In [7]:
df.tail()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
244099,F-JKPQ,अभियांत्रिकी $ जे.ई.ई. मेन $ भौतिक विज्ञान $ स...,NaN,NaN,NaN,NaN
244100,F-JKPP,अभियांत्रिकी $ जे.ई.ई. मेन $ भौतिक विज्ञान $ स...,NaN,NaN,NaN,NaN
244101,F-JKPR,अभियांत्रिकी $ जे.ई.ई. मेन $ भौतिक विज्ञान $ स...,NaN,NaN,NaN,NaN
244102,F-JKPT,अभियांत्रिकी $ जे.ई.ई. मेन $ भौतिक विज्ञान $ स...,NaN,NaN,NaN,NaN
244103,F-JKPS,अभियांत्रिकी $ जे.ई.ई. मेन $ भौतिक विज्ञान $ स...,NaN,NaN,NaN,NaN

In [8]:
df.shape

(244104, 6)

In [9]:
df.drop(df.columns[[2,3, 4, 5]], axis = 1, inplace = True)

In [10]:
df.shape

(244104, 2)

In [11]:
df.head()

  Unnamed: 0                                         Unnamed: 1
0        NaN                                                NaN
1     F-LJ2C                                             C-AK9N
2     F-LJ18                                          1 $ 2 $ 3
3     F-LJ2A                                          1 $ 2 $ 4
4     F-BTJ5  10th foundation $ 10th foundation $ chemistry ...

In [56]:
#df.drop(df.columns[2], axis = 1, inplace = True)

In [12]:
#df.head()

In [13]:
df.shape

(244104, 2)

In [14]:
for i in range (1,250000,5000):
    print(i)
    file =str(i)
    df_1 = df.iloc[i-5000:i,:]
    print("Shape of new dataframes - {}".format(df_1.shape))
    df_1.to_excel("Final"+file+'fTag.xlsx', header=["Ftag", "Description"],index=False)

1
Shape of new dataframes - (0, 2)
5001
Shape of new dataframes - (5000, 2)
10001
Shape of new dataframes - (5000, 2)
15001
Shape of new dataframes - (5000, 2)
20001
Shape of new dataframes - (5000, 2)
25001
Shape of new dataframes - (5000, 2)
30001
Shape of new dataframes - (5000, 2)
35001
Shape of new dataframes - (5000, 2)
40001
Shape of new dataframes - (5000, 2)
45001
Shape of new dataframes - (5000, 2)
50001
Shape of new dataframes - (5000, 2)
55001
Shape of new dataframes - (5000, 2)
60001
Shape of new dataframes - (5000, 2)
65001
Shape of new dataframes - (5000, 2)
70001
Shape of new dataframes - (5000, 2)
75001
Shape of new dataframes - (5000, 2)
80001
Shape of new dataframes - (5000, 2)
85001
Shape of new dataframes - (5000, 2)
90001
Shape of new dataframes - (5000, 2)
95001
Shape of new dataframes - (5000, 2)
100001
Shape of new dataframes - (5000, 2)
105001
Shape of new dataframes - (5000, 2)
110001
Shape of new dataframes - (5000, 2)
115001
Shape of new dataframes - (5000, 2)
120001
Shape of new dataframes - (5000, 2)
125001
Shape of new dataframes - (5000, 2)
130001
Shape of new dataframes - (5000, 2)
135001
Shape of new dataframes - (5000, 2)
140001
Shape of new dataframes - (5000, 2)
145001
Shape of new dataframes - (5000, 2)
150001
Shape of new dataframes - (5000, 2)
155001
Shape of new dataframes - (5000, 2)
160001
Shape of new dataframes - (5000, 2)
165001
Shape of new dataframes - (5000, 2)
170001
Shape of new dataframes - (5000, 2)
175001
Shape of new dataframes - (5000, 2)
180001
Shape of new dataframes - (5000, 2)
185001
Shape of new dataframes - (5000, 2)
190001
Shape of new dataframes - (5000, 2)
195001
Shape of new dataframes - (5000, 2)
200001
Shape of new dataframes - (5000, 2)
205001
Shape of new dataframes - (5000, 2)
210001
Shape of new dataframes - (5000, 2)
215001
Shape of new dataframes - (5000, 2)
220001
Shape of new dataframes - (5000, 2)
225001
Shape of new dataframes - (5000, 2)
230001
Shape of new dataframes - (5000, 2)
235001
Shape of new dataframes - (5000, 2)
240001
Shape of new dataframes - (5000, 2)
245001
Shape of new dataframes - (4103, 2)